# -*- mode:org; fill-column:99; -*-

#+title:Mastering Org-Mode
#+subtitle:Version {{{version}}} Last Updated {{{time(%F %R)}}}
#+author:Pinecone062
#+email:pinecone062@gmail.com
#+date:2020-10-16 07:17
#+macro:version Version 0.10.4
#+macro:upload-date (eval (current-time-string))
#+bucket:pinecone-forest.com

{{{version}}} {{{date}}}

** Agenda

  - Agenda :: Org can select items based on various criteria and display them in a separate
              buffer. Six different [[*View][view types]] are provided, one of which is ~agenda~: like a
              calendar and shows information for specific dates.  The extracted information is
              displayed in a special /agenda/ buffer.

    + Agenda Files :: The information to be shown is normally collected from all /agenda/
                      files, the files listed in the variable ~org-agenda-files~.  If a
                      directory is part of this list, all files with the extension ~.org~
                      in this directory will be part of the list.  Add and remove files
                      from this list using ~C-c [~ and ~C-c ]~.


      #+NAME:reveal-org-agenda-files
      #+BEGIN_SRC elisp :results pp
      org-agenda-files
      #+END_SRC

      #+RESULTS: reveal-org-agenda-files
      : ("/usr/local/dev/programming/Emacs/Org/Mastering-Org/mastering-org.org" "/usr/local/work/workorg/workcases.org" "/Users/lolh/.org/notes.org")

    + Cycling through agenda files :: ~C-,'~ ~(org-cycle-agenda-files)~

    + Switch between buffers :: ~M-x org-switchb <RET>~ ~iswitchb~ like interface

    + Agenda Dispatcher :: The views are created through a dispatcher, which should be bound to a
         [[*Global Keys][global key]]---for example ~C-c a~.  After pressing ~C-c a~, an additional letter is required
         to execute a command.  ~a~ produces a calendar-like /agenda/ view.  ~t~ produces a list of
         ~TODO~ items.  ~m~ produces headlines matching a ~TAGS~ expression.  There are others as
         well.  See [[https://orgmode.org/manual/Agenda-dispatcher.html#Agenda-dispatcher][Agender Dispatcher]].

